/*
Задача 1. Напишете програма, която проверява текстов файл дали всички
отворени къдрави скоби {, (, [ са затворени ] ),}. Изпишете грешка при липса на
затварящи скоби и реда на който са пропуснати.
Задача 2. Напишете функция, принтираща сигналите, които й се подават.
Обработка на сигнали signal.h (примера работи само със сигналите на Linux)
Задача 3. Напишете програма, в която използвате функцията time(), за да
принтирате всяка секунда. Използвайте alarm(), за да подадете сигнал за
настъпила минута signal (SIGALRM,..).
Задача 4. Напишете програма, която обработва Ctrl+C, Ctrl+D, Ctrl+Z
*/