/*
5. Дефинирайте едномерен масив int с 10 елемента =
{100,90,80,70,60,50,40,30,20,10}.
Дефинирайте пойнтер, който ще сочи към масива.
Достъпете 3 тия елемент от масива и му задайте стойност 5.
Достъпете 4 тия елемент и му задайте стойност 33.
Достъпете 5 тия елемент и го намалете със 7.
Достъпете 7 мия елемент и го увеличете с 10.
Достъпете 10 тия елемент и го умножете по 3.
Изпишете го по двата възможни начина и закоментирайте единия.
Принтирайте на екрана всички елементи на масива.
*/

#include <stdio.h>
#define SIZE 10

void printArray(int *arr);

int main()
{
    int array[SIZE] = {100, 90, 80, 70, 60, 50, 40, 30, 20, 10};
    int *pointer = array;
    array[2] = 5;
    array[3] = 33;
    array[4] -= 7;
    array[6] += 10;
    array[9] *= 3;
    printArray(array);

    /*Second way:
    *(pointer+2) = 5;
    *(pointer+3) = 33;
    *(pointer+4) -= 7;
    *(pointer+6) += 10;
    *(pointer+9) *= 3;
    printArray(array);
    */

    return 0;
}

void printArray(int *arr)

    for (int i = 0; i < SIZE; i++)
        printf("[%d] = %d\n", i, arr[i]);
    
    printf("\n");
}