/*
 7. Дадени са два правоъгълника със страни успоредни на координатните оси. Да се намерят:
сумата от лицата им, лицето на обединението и сечението им.
Вход. На всеки от редовете на стандартния вход ще бъде зададена по една двойка
правоъгълници с осем цели неотрицателни числа – координати на горния ляв и долния десен
ъгъл на единия и другия правоъгълник.
Ограничения. Всички числа са по-малки или равни на 100.
Изход. За всяка двойка правоъгълници, на един ред на стандартния изход програмата трябва да
изведе 3 числа — сумата от лицата на двата правоъгълника, лицето на обединението и лицето
на сечението им.
Пример:
Вход. Изход.
 0 1 1 0 0 2 2 0 5 4 1
 0 1 1 0 2 1 3 0 2 2 0
 0 2 3 1 1 3 2 0 6 5 1 
*/
#include "..\include\fnc.h"

int main()
{
	printf("Hello World!\n");

	return (0);
}