/*
12) Вдигнете всички битове на 32 битово число,
на позиции делящи се на 3.
*/
#include <stdio.h>

void changeTheBits(int *num)
{
    for (int i = 2; i < 32; i += 3)
    {
        *(num) |= (1 << i);
    }
    // num = 11 = 0000 0000 0000 0000 0000 0000 0000 1011
    // start of loop
    // num =      0000 0000 0000 0000 0000 0000 0000 1011 | 0000 0000 0000 0000 0000 0000 0000 0100
    // num =      0000 0000 0000 0000 0000 0000 0000 1111 | 0000 0000 0000 0000 0000 0000 0010 0000
    // num =      0000 0000 0000 0000 0000 0000 0010 1011 | 0000 0000 0000 0000 0000 0001 0000 0000
    //.
    //.
    //.
    // end of loop
    // num =  613 566 767    0010 0100 1001 0010 0100 1001 0010 1111
}

int main()
{
    int num = 11;
    changeTheBits(&num);
    printf("%d", num);
}