/*
1. - (преговор списъци) Да се състави програма, чрез която се въвеждат N броя
естествени числа от интервала [1..101].
Броят на въведените числа не се знае предварително - определя се от
потребителя.
Чрез използване на структура от тип опашка да се изведе въведената редица
естествени числа като:
а) първо се извеждат всички нечетни числа;
б) след тях се извеждат всички четни числа;
в) извеждането на числата съответства на реда на въвеждането им.
Пример: 11, 12, 15, 17, 19, 21, 23, 9, 10, 16, 18, 20
Изход: 11, 15, 17, 19, 21, 23, 9, 12, 10, 16, 18, 20
*/

#include "..\include\fnc.h"

queue * front , *rear;

int main()
{
	init();
	fillQueue();
	displayOdd();
	displayEven();
	deQueue();

	return 0;
}